backend/controllers/ExecuteController.php

    public function actionIndex() {
        $this->permitRole([1]);
        $time = date('Y-m-d H:i:s');
        $chk_proc = SysCheckProcess::find()->one();
---
SELECT * FROM `sys_check_process`