backend/controllers/SysconfigmainController.php

    function adjust($districtcode) {

        $camp = Campur::find()->where(['ampurcodefull' => $districtcode])->one();
        $distcode = $camp->ampurcode;
        $district_name = $camp->ampurname;

        $config_main = Sysconfigmain::find()->where(['district_code' => $districtcode])->one();
        $config_main->distcode = $distcode;
        $config_main->district_name = $district_name;
        $config_main->update();
---
SELECT * FROM `campur` WHERE `ampurcodefull`='5801'
SELECT * FROM `sys_config_main` WHERE `district_code`='5801'
UPDATE `sys_config_main` SET `distcode`='01', `district_name`='เมืองแม่ฮ่องสอน' WHERE `id`=10

    function add_hospital() {
        $cfg_main = Sysconfigmain::find()->one();
---
SELECT * FROM `sys_config_main`

    function add_cvillage() {
        $cfg_main = Sysconfigmain::find()->one();
---
SELECT * FROM `sys_config_main`

      function add_ctambon() {
        $cfg_main = Sysconfigmain::find()->one();
---
SELECT * FROM `sys_config_main`

    protected function findModel($id) {
        if (($model = Sysconfigmain::findOne($id)) !== null) {
---
SELECT * FROM `sys_config_main` WHERE `id`='10'

    public function actionListamp($provcode) {
        $this->permitRole([1]);
        $amp = Campur::find()->where(['changwatcode' => $provcode])->all();
---
SELECT * FROM `campur` WHERE `changwatcode`='58'