backend/views/layouts/main.php

SELECT * FROM `sys_config_main`
---
    </head>
    <body>
        <?php $this->beginBody() ?>
        <?php $config_main = backend\models\Sysconfigmain::find()->one(); ?>